ShearinZiw/GD32H7_FreeRTOS_emWin/tcp_client_FreeRTOS/GD32H7xx_GDemWin652/Sample/LCD_X/LCD_X_8080_16.c
/*********************************************************************
*                        SEGGER Software GmbH                        *
*        Solutions for real time microcontroller applications        *
**********************************************************************
*                                                                    *
*               (c) 1996 - 2023  SEGGER Software GmbH                *
*                                                                    *
*        Internet: www.segger.com    Support:  support@segger.com    *
*                                                                    *
**********************************************************************

** emWin V6.52 - Graphical user interface for embedded applications **
All  Intellectual Property rights  in the Software belongs to  SEGGER.
emWin is protected by  international copyright laws.  Knowledge of the
source code may not be used to write a similar product.  This file may
only be used in accordance with the following terms:

The software has been licensed to  GigaDevice Semiconductor Inc. whose
registered office is situated at  Building No.8, IC Park, No.9 Fenghao
East Road, Haidian, Beijing, China solely for the purposes of creating
libraries  for  ARM Cortex-M processor-based  devices, sublicensed and
distributed  under  the  terms  and conditions of the End User License
Agreement supplied by GigaDevice Semiconductor Inc.
Full source code is available at: www.segger.com

We appreciate your understanding and fairness.
----------------------------------------------------------------------
Licensing information
Licensor:                 SEGGER Software GmbH
Licensed to:              GigaDevice Semiconductor Inc., Building No.8, IC Park, No.9 Fenghao East Road, Beijing Haidian, , CHINA
Licensed SEGGER software: emWin
License number:           GUI-00918
License model:            Buyout SRC [Buyout Source Code License], according to Buyout Agreement signed Sep. 12th 2023 by Ivo Geilenbruegge and Aug. 31th 2023 by Guangyi Jin
Licensed product:         Any
Licensed platform:        Cortex-M
Licensed number of seats: -
----------------------------------------------------------------------
Support and Update Agreement (SUA)
SUA period:               2023-08-11 - 2026-08-26
Contact to extend SUA:    sales@segger.com
----------------------------------------------------------------------
File        : LCD_X_8080_16.c
Purpose     : Port routines 8080 interface, 16 bit data bus
----------------------------------------------------------------------
*/

#include "GUI.h"

#include "LCD_X_8080_16.h"

/*********************************************************************
*
*       Defines: Configuration
*
**********************************************************************
  Needs to be adapted to custom hardware.
*/
#define Chip_30600
#include <IOM16C.H>

#define LCD_CLR_RESET()   P7 &= ~(1<<0)
#define LCD_SET_RESET()   P7 |=  (1<<0)
#define LCD_CLR_A0()      P8 &= ~(1<<0)
#define LCD_SET_A0()      P8 |=  (1<<0)
#define LCD_CLR_WR()      P8 &= ~(1<<1)
#define LCD_SET_WR()      P8 |=  (1<<1)
#define LCD_CLR_RD()      P8 &= ~(1<<2)
#define LCD_SET_RD()      P8 |=  (1<<2)
#define LCD_CLR_CS()      P8 &= ~(1<<4)
#define LCD_SET_CS()      P8 |=  (1<<4)
#define LCD_DATA_IN_L     P10
#define LCD_DATA_IN_H     P1
#define LCD_DATA_OUT_L    P10
#define LCD_DATA_OUT_H    P1
#define LCD_SET_DIR_IN()  P1D = 0;    P10D = 0
#define LCD_SET_DIR_OUT() P1D = 0xff; P10D = 0xff
#define LCD_DELAY(ms)     GUI_X_Delay(ms)

/*********************************************************************
*
*       Defines: Common
*
**********************************************************************
  Usually, there is no need to modify these macros.
  It should be sufficient ot modify the low-level macros
  above.
*/
#define LCD_X_READ(c)                            \
  LCD_SET_DIR_IN();                              \
  LCD_CLR_CS();                                  \
  LCD_CLR_RD();                                  \
  c = LCD_DATA_IN_L | ((U16)LCD_DATA_IN_H << 8); \
  LCD_SET_CS();                                  \
  LCD_SET_RD();                                  \
  LCD_SET_DIR_OUT()

#define LCD_X_WRITE(c)                           \
  LCD_DATA_OUT_L = (unsigned char)c;             \
  LCD_DATA_OUT_H = c >> 8;                       \
  LCD_CLR_CS();                                  \
  LCD_CLR_WR();                                  \
  LCD_SET_WR();                                  \
  LCD_SET_CS()

/*********************************************************************
*
*       Public code
*
**********************************************************************
*/
/*********************************************************************
*
*       LCD_X_8080_16_Init
*
* Purpose:
*   This routine should be called from your application program
*   to set port pins to their initial values.
*   
*/
void LCD_X_8080_16_Init(void) {
  LCD_SET_CS();
  LCD_SET_RD();
  LCD_SET_WR();
  LCD_CLR_RESET();
  LCD_DELAY(5);
  LCD_SET_RESET();
  LCD_DELAY(5);
  LCD_SET_DIR_OUT();
}

/*********************************************************************
*
*       LCD_X_8080_16_Write00_16
*
* Purpose:
*   Write to controller, with A0 = 0
*/
void LCD_X_8080_16_Write00_16(U16 c) {
  LCD_CLR_A0();
  LCD_X_WRITE(c);
}

/*********************************************************************
*
*       LCD_X_8080_16_Write01_16
*
* Purpose:
*   Write to controller, with A0 = 1
*/
void LCD_X_8080_16_Write01_16(U16 c) {
  LCD_SET_A0();
  LCD_X_WRITE(c);
}

/*********************************************************************
*
*       LCD_X_8080_16_WriteM01_16
*
* Purpose:
*   Write multiple bytes to controller, with A0 = 1
*/
void LCD_X_8080_16_WriteM01_16(U16 * pData, int NumWords) {
  LCD_SET_A0();
  for (; NumWords; NumWords--) {
    LCD_X_WRITE(*pData);
    pData++;
  }
}

/*********************************************************************
*
*       LCD_X_8080_16_WriteM00_16
*
* Purpose:
*   Write multiple bytes to controller, with A0 = 0
*/
void LCD_X_8080_16_WriteM00_16(U16 * pData, int NumWords) {
  LCD_CLR_A0();
  for (; NumWords; NumWords--) {
    LCD_X_WRITE(*pData);
    pData++;
  }
}

/*********************************************************************
*
*       LCD_X_8080_16_Read00_16
*
* Purpose:
*   Read from controller, with A0 = 0
*/
U16 LCD_X_8080_16_Read00_16(void) {
  U16 c;
  LCD_CLR_A0();
  LCD_X_READ(c);
  return c;
}

/*********************************************************************
*
*       LCD_X_8080_16_Read01_16
*
* Purpose:
*   Read from controller, with A0 = 1
*/
U16 LCD_X_8080_16_Read01_16(void) {
  U16 c;
  LCD_SET_A0();
  LCD_X_READ(c);
  return c;
}

/*********************************************************************
*
*       LCD_X_8080_16_ReadM00_16
*
* Purpose:
*   Read multiple bytes from controller, with A0 = 0
*/
void LCD_X_8080_16_ReadM00_16(U16 * pData, int NumWords) {
  LCD_CLR_A0();
  for (; NumWords; NumWords--) {
    LCD_X_READ(*pData);
    pData++;
  }
}

/*********************************************************************
*
*       LCD_X_8080_16_ReadM01_16
*
* Purpose:
*   Read multiple bytes from controller, with A0 = 1
*/
void LCD_X_8080_16_ReadM01_16(U16 * pData, int NumWords) {
  LCD_SET_A0();
  for (; NumWords; NumWords--) {
    LCD_X_READ(*pData);
    pData++;
  }
}

/*************************** End of file ****************************/
